{
  "created": "2025-12-16T10:33:00Z",
  "defaults": {
    "opencode": {
      "permission_lines": [
        "  webfetch: allow",
        "  bash:",
        "    \"git diff\": allow",
        "    \"git log*\": allow",
        "    \"git status\": allow",
        "    \"git show*\": allow",
        "    \"pytest*\": allow",
        "    \"npm test*\": allow",
        "    \"uv run*\": allow",
        "    \"head*\": allow",
        "    \"tail*\": allow",
        "    \"cat*\": allow",
        "    \"ls*\": allow",
        "    \"tree*\": allow",
        "    \"find*\": allow",
        "    \"grep*\": allow",
        "    \"echo*\": allow",
        "    \"wc*\": allow",
        "    \"pwd\": allow",
        "    \"sed*\": deny",
        "    \"awk*\": deny",
        "    \"*\": ask",
        "  edit: ask"
      ],
      "tools_lines": [
        "  write: true",
        "  edit: true",
        "  bash: true",
        "  webfetch: true",
        "  read: true",
        "  grep: true",
        "  glob: true",
        "  list: true",
        "  patch: true",
        "  todowrite: true",
        "  todoread: true"
      ]
    }
  },
  "description": "Master templates for subagent content with configuration",
  "subagents": {
    "debugger": {
      "description": "Debugging specialist - finds and fixes bugs directly",
      "examples": [
        "  - \"Use for test failures and unexpected behavior diagnosis\"",
        "  - \"Use for performance issues and memory leaks\"",
        "  - \"Use for integration problems and API failures\"",
        "  - \"Use for complex multi-component issue resolution\""
      ],
      "header_lines": {
        "copilot": 5,
        "opencode": 46
      },
      "name": "debugger",
      "opencode": {}
    },
    "implementer": {
      "description": "Feature implementation specialist - builds new functionality and adds features. Follows YAGNI, KISS, DRY principles and leverages existing systems.",
      "examples": [
        "  - \"Use for new API endpoints with comprehensive error handling\"",
        "  - \"Use for complex business logic with thorough testing\"",
        "  - \"Use for UI components with accessibility and performance\""
      ],
      "header_lines": {
        "copilot": 4,
        "opencode": 45
      },
      "name": "implementer",
      "opencode": {}
    },
    "planner": {
      "description": "Software architect that creates detailed implementation plans without writing code. Emphasizes YAGNI, KISS, DRY, and leveraging existing systems.",
      "examples": [
        "  - \"Use for complex multi-step features requiring architectural design\"",
        "  - \"Use for large refactoring projects needing systematic planning\"",
        "  - \"Use for security-critical changes requiring careful risk assessment\""
      ],
      "header_lines": {
        "copilot": 4,
        "opencode": 25
      },
      "name": "planner",
      "opencode": {}
    },
    "refactor": {
      "description": "Refactoring specialist - improves code quality without changing behavior. Applies YAGNI, KISS, DRY principles and leverages existing systems.",
      "examples": [
        "  - \"Use for code smell elimination and technical debt reduction\"",
        "  - \"Use for performance optimization without behavior changes\"",
        "  - \"Use for improving code maintainability and readability\""
      ],
      "header_lines": {
        "copilot": 4,
        "opencode": 46
      },
      "name": "refactor",
      "opencode": {}
    },
    "reviewer": {
      "description": "Comprehensive code reviewer - finds bugs, logical issues, and code quality problems. Enforces YAGNI, KISS, DRY principles and validates existing system usage.",
      "examples": [
        "  - \"Use for security review of authentication systems\"",
        "  - \"Use for code quality assessment before merging\"",
        "  - \"Use for architectural validation of implementation plans\""
      ],
      "header_lines": {
        "copilot": 5,
        "opencode": 45
      },
      "name": "reviewer",
      "opencode": {}
    },
    "coordinator": {
      "description": "Multi-phase project coordinator - orchestrates specialized agents for systematic software engineering excellence. IMPORTANT: Manual invocation only. Never call @coordinator automatically. Only the user should invoke this agent manually for complex multi-phase tasks.",
      "examples": [
        "  - \"Use for complex multi-step software tasks requiring systematic execution\"",
        "  - \"Use for codebase cleanup and refactoring projects with quality assurance\"",
        "  - \"Use for feature implementation with comprehensive testing and review\""
      ],
      "header_lines": {
        "copilot": 6,
        "opencode": 47
      },
      "name": "coordinator",
      "opencode": {},
      "mode": "primary"
    }
  },
  "version": "1.0.0"
}
